[TC_WOTC_S79_AK74_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>AK-74</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>AK-74s</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The stock and grip were manufactured with synthetic fiberglass, instead of laminated wood.\n The AK-74 was adopted in 1974, but wasn't taken into combat until 1979 during the onset of the Soviet-Afgan War. During that time, the AK-74 was the primary assault rifle used by Soviet forces occupying Afganistan, but vehicle crews, special forces, airborne and rear-echelon support units were issued the AKS-74u, an assault carbine counterpart of the AK-74. Before the first alien war, the AK-74 was still in service in Russia, including former Soviet republics and several countries in Asia, such as Vietnam, North Korea, and Mongolia. Additionally, many licensed copies of the AK-74 were made."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Conventional"

[TC_WOTC_S79_AK74_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>RVK-74</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>RVK-74s</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The stock and grip were manufactured with synthetic fiberglass, instead of laminated wood.\n The AK-74 was adopted in 1974, but wasn't taken into combat until 1979 during the onset of the Soviet-Afgan War. During that time, the AK-74 was the primary assault rifle used by Soviet forces occupying Afganistan, but vehicle crews, special forces, airborne and rear-echelon support units were issued the AKS-74u, an assault carbine counterpart of the AK-74. Before the first alien war, the AK-74 was still in service in Russia, including former Soviet republics and several countries in Asia, such as Vietnam, North Korea, and Mongolia. and several. Additionally, many licensed copies of the AK-74 were made.\n The RVK-74 is an improvement to the aging AK-74. The high-pressure gas within the gas-operated firing system is replaced with a custom mixture of elerium and other gaseous products. The kinetic force of each profile is increased ten-fold, making the RVK-74 deadiler while reducing the kickback."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Magnetic"

[TC_WOTC_S79_AK74_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>RVK-74/203X</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>RVK-74/203Xs</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The stock and grip were manufactured with synthetic fiberglass, instead of laminated wood.\n The AK-74 was adopted in 1974, but wasn't taken into combat until 1979 during the onset of the Soviet-Afgan War. During that time, the AK-74 was the primary assault rifle used by Soviet forces occupying Afganistan, but vehicle crews, special forces, airborne and rear-echelon support units were issued the AKS-74u, an assault carbine counterpart of the AK-74. Before the first alien war, the AK-74 was still in service in Russia, including former Soviet republics and several countries in Asia, such as Vietnam, North Korea, and Mongolia. and several. Additionally, many licensed copies of the AK-74 were made.\n The barrel of the RVK-74/203X is custom made from alien alloy, and a counter-recoil dampening module is built within the weapon internal components, negating most of the recoil that the user might encounter when firing the RVK-74/203X."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Beam"

[TC_WOTC_SKR_S79_AK74_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>AK-74</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>AK-74s</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The stock and grip were manufactured with synthetic fiberglass, instead of laminated wood.\n The AK-74 was adopted in 1974, but wasn't taken into combat until 1979 during the onset of the Soviet-Afgan War. During that time, the AK-74 was the primary assault rifle used by Soviet forces occupying Afganistan, but vehicle crews, special forces, airborne and rear-echelon support units were issued the AKS-74u, an assault carbine counterpart of the AK-74. Before the first alien war, the AK-74 was still in service in Russia, including former Soviet republics and several countries in Asia, such as Vietnam, North Korea, and Mongolia. Additionally, many licensed copies of the AK-74 were made."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Conventional"

[TC_WOTC_SKR_S79_AK74_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>RVK-74</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>RVK-74s</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The stock and grip were manufactured with synthetic fiberglass, instead of laminated wood.\n The AK-74 was adopted in 1974, but wasn't taken into combat until 1979 during the onset of the Soviet-Afgan War. During that time, the AK-74 was the primary assault rifle used by Soviet forces occupying Afganistan, but vehicle crews, special forces, airborne and rear-echelon support units were issued the AKS-74u, an assault carbine counterpart of the AK-74. Before the first alien war, the AK-74 was still in service in Russia, including former Soviet republics and several countries in Asia, such as Vietnam, North Korea, and Mongolia. and several. Additionally, many licensed copies of the AK-74 were made.\n The RVK-74 is an improvement to the aging AK-74. The high-pressure gas within the gas-operated firing system is replaced with a custom mixture of elerium and other gaseous products. The kinetic force of each profile is increased ten-fold, making the RVK-74 deadiler while reducing the kickback."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Magnetic"

[TC_WOTC_SKR_S79_AK74_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>RVK-74/203X</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>RVK-74/203Xs</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The stock and grip were manufactured with synthetic fiberglass, instead of laminated wood.\n The AK-74 was adopted in 1974, but wasn't taken into combat until 1979 during the onset of the Soviet-Afgan War. During that time, the AK-74 was the primary assault rifle used by Soviet forces occupying Afganistan, but vehicle crews, special forces, airborne and rear-echelon support units were issued the AKS-74u, an assault carbine counterpart of the AK-74. Before the first alien war, the AK-74 was still in service in Russia, including former Soviet republics and several countries in Asia, such as Vietnam, North Korea, and Mongolia. and several. Additionally, many licensed copies of the AK-74 were made.\n The barrel of the RVK-74/203X is custom made from alien alloy, and a counter-recoil dampening module is built within the weapon internal components, negating most of the recoil that the user might encounter when firing the RVK-74/203X."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Beam"